indexxue/TM4C123GH6PM/Common/src/proto.c
static void proto_suppress_pushes(uint32_t ms)
{
    s_push_suppress_until_ms = proto_uptime_ms() + ms;
}

static bool_t proto_host_rx_active(void)
{
    if (s_parser.state != PROTO_PARSE_SOF0) {
        return TRUE;
    }
    if (proto_uart_rx_pending()) {
        return TRUE;
    }
    if (proto_uptime_ms() < s_rx_gate_until_ms) {
        return TRUE;
    }
    return FALSE;
}

static bool_t proto_build_frame(uint8_t *frame, uint16_t *total_out, uint16_t cmd, uint8_t seq,
                                const uint8_t *payload, uint16_t len, uint8_t extra_flags)
{
    uint8_t *body;
    uint16_t crc;
    uint16_t total;
    uint8_t flags = (uint8_t)(PROTO_FLAG_DIR_DEVICE | extra_flags);

    if ((frame == NULL) || (total_out == NULL) || (len > PROTO_MAX_PAYLOAD)) {
        return FALSE;
    }

    frame[0] = PROTO_SOF0;
    frame[1] = PROTO_SOF1;
    body = &frame[2];
    body[0] = PROTO_VER;
    body[1] = flags;
    proto_put_u16(&body[2], len);
    proto_put_u16(&body[4], cmd);
    body[6] = seq;
    if ((len > 0U) && (payload != NULL)) {
        (void)memcpy(&body[7], payload, len);
    }

    crc = proto_crc16_ccitt_false(body, (uint16_t)(PROTO_HEADER_SIZE + len));
    proto_put_u16(&body[7 + len], crc);
    total = (uint16_t)(2U + PROTO_HEADER_SIZE + len + 2U);
    *total_out = total;
    return TRUE;
}

static bool_t proto_enqueue_frame_bytes(const uint8_t *frame, uint16_t len, bool_t to_front)
{
    proto_tx_item_t item;
    BaseType_t ok;

    if ((frame == NULL) || (len == 0U) || (len > PROTO_TX_MAX_FRAME) || (s_tx_queue == NULL)) {
        return FALSE;
    }

    item.len = len;
    (void)memcpy(item.bytes, frame, len);
    if (to_front) {
        ok = xQueueSendToFront(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    } else {
        ok = xQueueSend(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    }
    if (ok != pdTRUE) {
        LOG_WARN("proto: tx queue full drop %uB", (unsigned)len);
        return FALSE;
    }
    return TRUE;
}

static bool_t proto_uart_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                                    uint8_t extra_flags, bool_t immediate, bool_t queue_front)
{
    uint8_t frame[PROTO_TX_MAX_FRAME];
    uint16_t total;

    if (!proto_build_frame(frame, &total, cmd, seq, payload, len, extra_flags)) {
        return FALSE;
    }

    if (immediate) {
        if (!proto_tx_lock()) {
            return FALSE;
        }
        proto_uart_write_locked(frame, total);
        proto_tx_unlock();
        return TRUE;
    }

    return proto_enqueue_frame_bytes(frame, total, queue_front);
}

static bool_t proto_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                               uint8_t extra_flags)
{
    return proto_uart_send_frame(cmd, seq, payload, len, extra_flags, FALSE, FALSE);
}

static void proto_reply_ack(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, TRUE, FALSE)) {
        LOG_WARN("proto: reply ack immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, FALSE, TRUE);
    }
}

static void proto_reply_nak(uint16_t cmd, uint8_t seq, uint8_t err_code)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, TRUE, FALSE)) {
        LOG_WARN("proto: reply nak immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, FALSE, TRUE);
    }
}

static void proto_push_frame(const uint8_t *payload, uint16_t len)
{
    proto_send_frame(PROTO_CMD_TELEMETRY_PUSH, 0U, payload, len, PROTO_FLAG_UNSOLICITED);
}

/* -------------------------------------------------------------------------- */
/* 参数写入适配                                                               */
/* -------------------------------------------------------------------------- */

static status_t proto_write_fw_version(const uint8_t *data, uint16_t len)
{
    char ver[NVS_CFG_FW_VER_MAX];

    if ((data == NULL) || (len == 0U) || (len >= NVS_CFG_FW_VER_MAX)) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(ver, data, len);
    ver[len] = '\0';
    return nvs_param_set_fw_version(ver, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_pid_speed(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_speed(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_line(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_line(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_line_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_yaw(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_yaw(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_angle_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_dist(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_dist(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_distance_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

