indexxue/TM4C123GH6PM/Common/src/proto.c
/* -------------------------------------------------------------------------- */
/* 遥测                                                                       */
/* -------------------------------------------------------------------------- */

static void proto_sample_line_adc(uint16_t *out, size_t count)
{
    size_t i;

    if ((out == NULL) || (count == 0U)) {
        return;
    }
    for (i = 0U; i < count; i++) {
        out[i] = 0U;
    }
    if (!device_profile_board_wants(DEVICE_BOARD_MASK_LINE)) {
        return;
    }
    (void)Line_Sample(out, count);
}

static uint16_t proto_sample_ultrasonic_mm(void)
{
    uint16_t mm = PROTO_ULTRA_INVALID_MM;
    status_t st;

    if (!device_profile_board_wants(DEVICE_BOARD_MASK_PERIPH)) {
        return PROTO_ULTRA_INVALID_MM;
    }

    /* PC1=Echo/SWDIO：boot 灯效结束后再 init，避免占用 SWD 影响烧录 */
    if (s_ultra_init_attempted == FALSE) {
        if (led_scene_is_active()) {
            return PROTO_ULTRA_INVALID_MM;
        }
        s_ultra_init_attempted = TRUE;
        if (ultrasonic_init() != STATUS_OK) {
            return PROTO_ULTRA_INVALID_MM;
        }
        s_ultra_ready = TRUE;
    }

    if (s_ultra_ready == FALSE) {
        return PROTO_ULTRA_INVALID_MM;
    }

    st = ultrasonic_measure_mm(&mm);
    if (st != STATUS_OK) {
        return PROTO_ULTRA_INVALID_MM;
    }
    return mm;
}

static uint8_t proto_line_detect_mask(void)
{
    uint16_t line_adc[PROTO_LINE_ADC_COUNT];

    proto_sample_line_adc(line_adc, PROTO_LINE_ADC_COUNT);
    return line_follow_mask_from_adc(line_adc, PROTO_LINE_ADC_COUNT);
}

static uint16_t proto_build_telemetry(uint8_t *out, uint16_t out_max)
{
    battery_voltage_t batt = {0};
    battery_info_t info = {0};
    attitude_euler_t euler = {0};
    int32_t enc[PROTO_ENCODER_COUNT];
    uint8_t batt_pct = 0U;
    uint16_t batt_mv = 0U;
    int16_t roll = 0;
    int16_t pitch = 0;
    int16_t yaw = 0;
    uint8_t i;
    const uint16_t need = (uint16_t)(2U + 1U + 6U + (uint16_t)(4 * PROTO_ENCODER_COUNT) + 1U + 4U + 2U);

    if ((out == NULL) || (out_max < need)) {
        return 0U;
    }

    (void)battery_percent_update();
    (void)battery_info_read(&info, &batt);
    batt_mv = batt.current_mv;
    batt_pct = info.percent;

    if (attitude_is_ready() && (attitude_get_euler(&euler) == STATUS_OK)) {
        roll = euler.roll;
        pitch = euler.pitch;
        yaw = euler.yaw;
    }

    for (i = 0U; i < PROTO_ENCODER_COUNT; i++) {
        enc[i] = cfg_encoder_count(i);
    }

    proto_put_u16(&out[0], batt_mv);
    out[2] = batt_pct;
    proto_put_i16(&out[3], roll);
    proto_put_i16(&out[5], pitch);
    proto_put_i16(&out[7], yaw);
    for (i = 0U; i < PROTO_ENCODER_COUNT; i++) {
        proto_put_u32(&out[9U + (i * 4U)], (uint32_t)enc[i]);
    }
    {
        const uint16_t line_off = (uint16_t)(9U + (4U * PROTO_ENCODER_COUNT));
        const uint16_t uptime_off = (uint16_t)(line_off + 1U);

        out[line_off] = proto_line_detect_mask();
        proto_put_u32(&out[uptime_off], proto_uptime_ms());
        proto_put_u16(&out[uptime_off + 4U], proto_sample_ultrasonic_mm());
    }
    return need;
}

static uint8_t proto_effective_hz(uint8_t hz, uint8_t default_hz)
{
    return (hz == 0U) ? default_hz : hz;
}

static uint32_t proto_period_ms_for(uint8_t hz, uint8_t default_hz)
{
    uint8_t eff = proto_effective_hz(hz, default_hz);

    if (eff == 0U) {
        return 1000U;
    }
    return 1000U / (uint32_t)eff;
}

static void proto_push_attitude(void)
{
    attitude_euler_t euler = {0};
    uint8_t payload[5U + 6U];
    int16_t roll = 0;
    int16_t pitch = 0;
    int16_t yaw = 0;

    if (attitude_is_ready()) {
        (void)attitude_get_euler(&euler);
        roll = euler.roll;
        pitch = euler.pitch;
        yaw = euler.yaw;
    }

    payload[0] = PROTO_PUSH_CH_ATTITUDE;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_i16(&payload[5], roll);
    proto_put_i16(&payload[7], pitch);
    proto_put_i16(&payload[9], yaw);
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_encoder(void)
{
    uint8_t payload[5U + (4U * PROTO_ENCODER_COUNT)];
    uint8_t i;

    payload[0] = PROTO_PUSH_CH_ENCODER;
    proto_put_u32(&payload[1], proto_uptime_ms());
    for (i = 0U; i < PROTO_ENCODER_COUNT; i++) {
        proto_put_u32(&payload[5U + (i * 4U)], (uint32_t)cfg_encoder_count(i));
    }
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_battery(void)
{
    battery_voltage_t batt = {0};
    battery_info_t info = {0};
    uint8_t payload[5U + 3U];

    (void)battery_percent_update();
    (void)battery_info_read(&info, &batt);
    payload[0] = PROTO_PUSH_CH_BATTERY;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_u16(&payload[5], batt.current_mv);
    payload[7] = info.percent;
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_line_adc(void)
{
    uint8_t payload[5U + 1U + (2U * PROTO_LINE_ADC_COUNT)];
    uint16_t line_adc[PROTO_LINE_ADC_COUNT];
    uint8_t i;

    proto_sample_line_adc(line_adc, PROTO_LINE_ADC_COUNT);

    payload[0] = PROTO_PUSH_CH_LINE_ADC;
    proto_put_u32(&payload[1], proto_uptime_ms());
    payload[5] = line_follow_mask_from_adc(line_adc, PROTO_LINE_ADC_COUNT);
    for (i = 0U; i < PROTO_LINE_ADC_COUNT; i++) {
        proto_put_u16(&payload[6U + (2U * i)], line_adc[i]);
    }
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_motor_rpm(void)
{
    uint8_t payload[5U + (4U * 4U)];
    uint8_t i;

    payload[0] = PROTO_PUSH_CH_MOTOR_RPM;
    proto_put_u32(&payload[1], proto_uptime_ms());
    for (i = 0U; i < PROTO_ENCODER_COUNT; i++) {
        proto_put_i32(&payload[5U + (i * 4U)], chassis_get_wheel_rpm((uint8_t)(i + 1U)));
    }
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_angle_loop(void)
{
    uint8_t payload[5U + 2U + 2U + 4U + 4U + (4U * 4U)];
    s32_t enc[4];
    u8_t i;

    payload[0] = PROTO_PUSH_CH_ANGLE_LOOP;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_i16(&payload[5], chassis_get_angle_target_yaw());
    proto_put_i16(&payload[7], chassis_get_angle_current_yaw());
    proto_put_i32(&payload[9], chassis_get_angle_turn_rpm());
    proto_put_i32(&payload[13], chassis_get_angle_base_rpm());
    chassis_get_encoder_counts(enc);
    for (i = 0U; i < 4U; i++) {
        proto_put_i32(&payload[17U + (i * 4U)], enc[i]);
    }
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_distance_loop(void)
{
    uint8_t payload[5U + 4U + 4U + 4U + 4U];

    payload[0] = PROTO_PUSH_CH_DISTANCE_LOOP;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_i32(&payload[5], chassis_get_distance_target_mm());
    proto_put_i32(&payload[9], chassis_get_distance_current_mm());
    proto_put_i32(&payload[13], chassis_get_distance_cmd_rpm());
    proto_put_i32(&payload[17], chassis_get_distance_max_rpm());
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static s16_t proto_line_error_to_i16(f32_t err)
{
    /* 加权偏差约 -5..+5，×100 上报 */
    f32_t scaled = err * 100.0f;
    if (scaled > 32767.0f) {
        return 32767;
    }
    if (scaled < -32768.0f) {
        return -32768;
    }
    if (scaled >= 0.0f) {
        return (s16_t)(scaled + 0.5f);
    }
    return (s16_t)(scaled - 0.5f);
}

static void proto_push_line_loop(void)
{
    uint8_t payload[5U + 2U + 1U + 1U + 4U + 4U + 4U];
    f32_t left;
    f32_t right;
    f32_t turn;

    payload[0] = PROTO_PUSH_CH_LINE_LOOP;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_i16(&payload[5], proto_line_error_to_i16(line_follow_get_error()));
    payload[7] = line_follow_get_detect_mask();
    payload[8] = (uint8_t)line_follow_get_state();
    left = line_follow_get_left_rpm();
    right = line_follow_get_right_rpm();
    turn = line_follow_get_turn_rpm();
    proto_put_i32(&payload[9], (left >= 0.0f) ? (s32_t)(left + 0.5f) : (s32_t)(left - 0.5f));
    proto_put_i32(&payload[13], (right >= 0.0f) ? (s32_t)(right + 0.5f) : (s32_t)(right - 0.5f));
    proto_put_i32(&payload[17], (turn >= 0.0f) ? (s32_t)(turn + 0.5f) : (s32_t)(turn - 0.5f));
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

