indexxue/TM4C123GH6PM/Common/src/proto.c
    chassis_set_line_follow(base_rpm);
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_suppress_pushes(PROTO_PUSH_SUPPRESS_MS);
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SET_LINE_FOLLOW, seq, NULL, 0U);
}

static void proto_handle_line_follow_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_LINE_FOLLOW) == 0U) {
        proto_reply_nak(PROTO_CMD_LINE_FOLLOW_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_LINE_FOLLOW_STOP, seq, NULL, 0U);
}

static int16_t proto_float_deg_to_i16(float deg)
{
    if (deg >= 0.0f) {
        return (int16_t)(deg + 0.5f);
    }
    return (int16_t)(deg - 0.5f);
}

static void proto_handle_calib_yaw(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int16_t ref_yaw_i16;
    float ref_yaw;
    float offset_deg;
    float yaw_deg;
    uint8_t ack[4];
    status_t st;

    if ((proto_caps() & PROTO_CAP_YAW_CALIB) == 0U) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len != 2U) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    ref_yaw_i16 = proto_get_i16(payload);
    if ((ref_yaw_i16 < -180) || (ref_yaw_i16 > 180)) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);

    ref_yaw = (float)ref_yaw_i16;
    st = attitude_calibrate_yaw(ref_yaw, &offset_deg, &yaw_deg);
    if (st == STATUS_FAIL) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_BUSY);
        return;
    }
    if (st == STATUS_INVALID_STATE) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_NVS_WRITE_FAIL);
        return;
    }

    proto_put_i16(&ack[0], proto_float_deg_to_i16(offset_deg));
    proto_put_i16(&ack[2], proto_float_deg_to_i16(yaw_deg));
    proto_reply_ack(PROTO_CMD_CALIB_YAW, seq, ack, (uint16_t)sizeof(ack));
}

static uint8_t proto_cam_st_to_err(status_t st)
{
    if (st == STATUS_OK) {
        return 0U;
    }
    if (st == STATUS_INVALID_ARG) {
        return PROTO_ERR_PARAM_VALUE_INVALID;
    }
    if (st == STATUS_NOT_SUPPORTED) {
        return PROTO_ERR_UNSUPPORTED;
    }
    if ((st == STATUS_INVALID_STATE) || (st == STATUS_TIMEOUT)) {
        return PROTO_ERR_BUSY;
    }
    return PROTO_ERR_UNSUPPORTED;
}

static void proto_handle_cam_servo_center(uint8_t seq)
{
    status_t st;

    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_CENTER, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    st = camera_spi_ctrl_servo_center();
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_CENTER, seq, proto_cam_st_to_err(st));
        return;
    }
    proto_reply_ack(PROTO_CMD_CAM_SERVO_CENTER, seq, NULL, 0U);
}

static void proto_handle_cam_servo_set_angle(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    status_t st;
    uint8_t ch;
    int16_t deg;

    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_SET_ANGLE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 3U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    ch = payload[0];
    deg = proto_get_i16(&payload[1]);
    if (ch > 1U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    st = camera_spi_ctrl_servo_set_angle(ch, deg);
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_SET_ANGLE, seq, proto_cam_st_to_err(st));
        return;
    }
    proto_reply_ack(PROTO_CMD_CAM_SERVO_SET_ANGLE, seq, NULL, 0U);
}

static void proto_handle_cam_servo_nudge(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    status_t st;
    uint8_t ch;
    int16_t delta;

    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_NUDGE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 3U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_NUDGE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    ch = payload[0];
    delta = proto_get_i16(&payload[1]);
    if (ch > 1U) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_NUDGE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    st = camera_spi_ctrl_servo_nudge(ch, delta);
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CAM_SERVO_NUDGE, seq, proto_cam_st_to_err(st));
        return;
    }
    proto_reply_ack(PROTO_CMD_CAM_SERVO_NUDGE, seq, NULL, 0U);
}

static void proto_handle_cam_detect_enable(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    status_t st;

    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_CAM_DETECT_ENABLE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_CAM_DETECT_ENABLE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    st = camera_spi_ctrl_detect_enable(payload[0]);
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CAM_DETECT_ENABLE, seq, proto_cam_st_to_err(st));
        return;
    }
    proto_reply_ack(PROTO_CMD_CAM_DETECT_ENABLE, seq, NULL, 0U);
}

static void proto_handle_get_cam_snapshot(uint8_t seq)
{
    camera_spi_stats_t stats;
    camera_spi_detect_t det;
    camera_spi_servo_t servo;
    uint8_t payload[48];
    uint8_t i;

    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_GET_CAM_SNAPSHOT, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }

    (void)memset(&stats, 0, sizeof(stats));
    (void)memset(&det, 0, sizeof(det));
    (void)memset(&servo, 0, sizeof(servo));
    (void)camera_spi_get_stats(&stats);
    (void)camera_spi_get_detect(&det);
    (void)camera_spi_get_servo(&servo);

    (void)memset(payload, 0, sizeof(payload));
    payload[0] = (uint8_t)stats.link;
    payload[1] = stats.peer_role;
    payload[2] = (det.valid != FALSE) ? 1U : 0U;
    payload[3] = det.count;
    payload[4] = det.best_index;
    proto_put_u16(&payload[5], det.frame_w);
    proto_put_u16(&payload[7], det.frame_h);
    for (i = 0U; i < 2U; i++) {
        uint8_t *b = &payload[9U + (i * 8U)];
        proto_put_u16(&b[0], det.box[i].x);
        proto_put_u16(&b[2], det.box[i].y);
        proto_put_u16(&b[4], det.box[i].w);
        b[6] = det.box[i].score_u8;
        b[7] = det.box[i].class_id;
    }
    payload[25] = (servo.valid != FALSE) ? 1U : 0U;
    proto_put_i16(&payload[26], servo.pan_deg_x100);
    proto_put_i16(&payload[28], servo.tilt_deg_x100);
    proto_put_u16(&payload[30], servo.pan_pulse_us);
    proto_put_u16(&payload[32], servo.tilt_pulse_us);
    proto_reply_ack(PROTO_CMD_GET_CAM_SNAPSHOT, seq, payload, 34U);
}

static void proto_handle_get_cam_net(uint8_t seq)
{
    camera_spi_net_info_t net;
    uint8_t payload[12];
    status_t st;

