indexxue/TM4C123GH6PM/Common/src/proto.c
    if ((proto_caps() & PROTO_CAP_CAMERA) == 0U) {
        proto_reply_nak(PROTO_CMD_GET_CAM_NET, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }

    (void)memset(&net, 0, sizeof(net));
    st = camera_spi_get_net_info(&net);
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_GET_CAM_NET, seq, proto_cam_st_to_err(st));
        return;
    }

    /* 缓存无效或无 IP 时请求一次；首版仍返回当前缓存（可能 HAS_IP=0） */
    if ((net.valid == FALSE) || ((net.flags & CAMERA_SPI_NET_FLAG_HAS_IP) == 0U)) {
        (void)camera_spi_request_net_info();
        (void)camera_spi_get_net_info(&net);
    }

    (void)memset(payload, 0, sizeof(payload));
    proto_put_u32(&payload[0], net.ipv4);
    proto_put_u16(&payload[4], net.http_port);
    payload[6] = net.wifi_mode;
    payload[7] = net.flags;
    payload[8] = net.stream_path_id;
    payload[9] = (net.valid != FALSE) ? 1U : 0U;
    proto_reply_ack(PROTO_CMD_GET_CAM_NET, seq, payload, 10U);
}

static void proto_dispatch(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len)
{
    if ((cmd == PROTO_CMD_SUBSCRIBE) || (cmd == PROTO_CMD_UNSUBSCRIBE) ||
        (cmd == PROTO_CMD_SET_SPEED) || (cmd == PROTO_CMD_SPEED_STOP) ||
        (cmd == PROTO_CMD_ANGLE_STOP) ||
        (cmd == PROTO_CMD_SET_DISTANCE) || (cmd == PROTO_CMD_DISTANCE_STOP) ||
        (cmd == PROTO_CMD_SET_LINE_FOLLOW) || (cmd == PROTO_CMD_LINE_FOLLOW_STOP) ||
        (cmd == PROTO_CMD_CALIB_YAW) ||
        (cmd == PROTO_CMD_DRIVE) || (cmd == PROTO_CMD_DRIVE_STOP) ||
        (cmd == PROTO_CMD_CAM_SERVO_CENTER) || (cmd == PROTO_CMD_CAM_SERVO_SET_ANGLE) ||
        (cmd == PROTO_CMD_CAM_SERVO_NUDGE) || (cmd == PROTO_CMD_CAM_DETECT_ENABLE) ||
        (cmd == PROTO_CMD_GET_CAM_NET)) {
        proto_rx_gate_hold_cmd();
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_MS);
    }

    /* SET_ANGLE 不抑制推送：角度环遥测是观察机动状态的唯一途径 */
    if (cmd == PROTO_CMD_SET_ANGLE) {
        proto_rx_gate_hold_cmd();
    }

    switch (cmd) {
    case PROTO_CMD_HELLO:
        proto_handle_hello(seq);
        break;
    case PROTO_CMD_PING:
        proto_handle_ping(seq);
        break;
    case PROTO_CMD_GET_TELEMETRY:
        proto_handle_get_telemetry(seq);
        break;
    case PROTO_CMD_SUBSCRIBE:
        proto_handle_subscribe(seq, payload, len);
        break;
    case PROTO_CMD_UNSUBSCRIBE:
        proto_handle_unsubscribe(seq, payload, len);
        break;
    case PROTO_CMD_PARAM_LIST:
        proto_handle_param_list(seq);
        break;
    case PROTO_CMD_PARAM_READ:
        proto_handle_param_read(seq, payload, len);
        break;
    case PROTO_CMD_PARAM_WRITE:
        proto_handle_param_write(seq, payload, len);
        break;
    case PROTO_CMD_DRIVE:
        proto_handle_drive(seq, payload, len);
        break;
    case PROTO_CMD_DRIVE_STOP:
        proto_handle_drive_stop(seq);
        break;
    case PROTO_CMD_SET_SPEED:
        proto_handle_set_speed(seq, payload, len);
        break;
    case PROTO_CMD_SPEED_STOP:
        proto_handle_speed_stop(seq);
        break;
    case PROTO_CMD_SET_ANGLE:
        proto_handle_set_angle(seq, payload, len);
        break;
    case PROTO_CMD_ANGLE_STOP:
        proto_handle_angle_stop(seq);
        break;
    case PROTO_CMD_SET_DISTANCE:
        proto_handle_set_distance(seq, payload, len);
        break;
    case PROTO_CMD_DISTANCE_STOP:
        proto_handle_distance_stop(seq);
        break;
    case PROTO_CMD_SET_LINE_FOLLOW:
        proto_handle_set_line_follow(seq, payload, len);
        break;
    case PROTO_CMD_LINE_FOLLOW_STOP:
        proto_handle_line_follow_stop(seq);
        break;
    case PROTO_CMD_CALIB_YAW:
        proto_handle_calib_yaw(seq, payload, len);
        break;
    case PROTO_CMD_CAM_SERVO_CENTER:
        proto_handle_cam_servo_center(seq);
        break;
    case PROTO_CMD_CAM_SERVO_SET_ANGLE:
        proto_handle_cam_servo_set_angle(seq, payload, len);
        break;
    case PROTO_CMD_CAM_SERVO_NUDGE:
        proto_handle_cam_servo_nudge(seq, payload, len);
        break;
    case PROTO_CMD_CAM_DETECT_ENABLE:
        proto_handle_cam_detect_enable(seq, payload, len);
        break;
    case PROTO_CMD_GET_CAM_SNAPSHOT:
        proto_handle_get_cam_snapshot(seq);
        break;
    case PROTO_CMD_GET_CAM_NET:
        proto_handle_get_cam_net(seq);
        break;
    default:
        proto_reply_nak(cmd, seq, PROTO_ERR_UNKNOWN_CMD);
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* 帧解析                                                                     */
/* -------------------------------------------------------------------------- */

static bool_t proto_rx_set_speed_semantic_ok(const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int32_t rpm;

    if ((payload == NULL) || (len < 1U)) {
        return FALSE;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len != 6U) {
            return FALSE;
        }
        if ((payload[1] < 1U) || (payload[1] > PROTO_ENCODER_COUNT)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[2]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        return TRUE;
    case 1U:
        if (len != 9U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[1]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[5]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        return TRUE;
    case 2U:
        return (len == 17U);
    default:
        return FALSE;
    }
}

static bool_t proto_rx_set_angle_semantic_ok(const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int32_t rpm;

    if ((payload == NULL) || (len < 1U)) {
        return FALSE;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len != 7U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[3]);
        return (rpm <= 1200) && (rpm >= -1200);
    case 1U:
        if (len != 11U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[3]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[7]);
        return (rpm <= 1200) && (rpm >= -1200);
    default:
        return FALSE;
    }
}

/**
 * HC-05 等蓝牙链路上常见「帧体正确、CRC 尾字节损坏」。
 * 在严格 CRC 失败时，若头/载荷语义自洽则放宽接受（仍由 dispatch 做业务校验）。
 */
static bool_t proto_rx_relaxed_crc_ok(uint16_t cmd, const uint8_t *hdr, const uint8_t *payload,
                                      uint16_t len)
{
    if ((hdr == NULL) || (hdr[0] != PROTO_VER) || ((hdr[1] & PROTO_FLAG_DIR_DEVICE) != 0U)) {
        return FALSE;
    }

    switch (cmd) {
    case PROTO_CMD_HELLO:
    case PROTO_CMD_PING:
    case PROTO_CMD_GET_TELEMETRY:
    case PROTO_CMD_SPEED_STOP:
    case PROTO_CMD_ANGLE_STOP:
    case PROTO_CMD_DRIVE_STOP:
    case PROTO_CMD_PARAM_LIST:
        return (len == 0U);
    case PROTO_CMD_SUBSCRIBE:
        return (len == 4U) || (len == 9U) || (len == 10U);
    case PROTO_CMD_UNSUBSCRIBE:
        return (len >= 4U);
    case PROTO_CMD_SET_SPEED:
        return proto_rx_set_speed_semantic_ok(payload, len);
    case PROTO_CMD_SET_ANGLE:
        return proto_rx_set_angle_semantic_ok(payload, len);
    case PROTO_CMD_CALIB_YAW:
        return (len == 2U);
    case PROTO_CMD_DRIVE:
        if (len != 4U) {
            return FALSE;
        }
        {
            int16_t throttle = proto_get_i16(&payload[0]);
            int16_t steer = proto_get_i16(&payload[2]);
            if ((throttle < -PROTO_DRIVE_THROTTLE_MAX) || (throttle > PROTO_DRIVE_THROTTLE_MAX) ||
                (steer < -PROTO_DRIVE_STEER_MAX) || (steer > PROTO_DRIVE_STEER_MAX)) {
                return FALSE;
            }
        }
        return TRUE;
    case PROTO_CMD_PARAM_READ:
        return (len == 2U);
    case PROTO_CMD_PARAM_WRITE:
        return (len >= 3U);
    default:
        return FALSE;
    }
}

static void proto_parse_reset(void)
{
    s_parser.state = PROTO_PARSE_SOF0;
    s_parser.body_len = 0U;
    proto_rx_gate_hold();
}

static void proto_parse_byte(uint8_t byte)
{
    uint16_t payload_len;
    uint16_t crc_expected;
    uint16_t crc_actual;
    uint16_t cmd;
    uint8_t seq;
    const uint8_t *payload;

